{"pageProps":{"posts":[{"slug":"machine-learning-concepts","meta":{"title":"Machine Learning Key Concepts","date":"2024-09-17","description":"Machine learning is a subset of AI that involves developing algorithms that allow computers to learn from & make predictions or decisions based on data.","author":"irufano","tags":["Machine Learning"],"image":"https://ogrisel.github.io/scikit-learn.org/sklearn-tutorial/_images/plot_ML_flow_chart_12.png"},"rawContent":"\n## Definition\n\nMachine learning (ML) is a subset of artificial intelligence (AI) that involves developing algorithms that allow computers to learn from and make predictions or decisions `based on data`. Instead of being explicitly programmed to perform tasks, machine learning models `identify patterns` in data and improve their performance as they are exposed to more data over time.\n\n## Traditional Programming VS ML\n\n### Traditional Programming\n\nTraditional programming is a manual process—meaning a person (programmer) creates the program. But without anyone programming the logic, one has to manually formulate or code rules.\n\n> [note]: **Traditional Programming**\n> INPUT + PROGRAM = OUTPUT\n\n### Machine Learning\nIn machine learning, on the other hand, the algorithm automatically formulates the rules from the data.\n\n> [note]: **Machine Learning**\n> INPUT + OUTPUT = PROGRAM (Model)\n\n## Rules for Using ML\n\nThere are 3 rules that are needed when we are going to use machine learning. One is mandatory and the other 2 are optional.\n\n### Data\n\nData is mandatory rule. When we use machine learning, ensure we have `data`, specially `historical data` because machine learning is learned from experience, where one of the experiences is historical data. Once we have data we can probably use machine learning.\n\n### Pattern (Optional)\n\nWe must know that the problems we face have a `pattern`. One form of machine learning is pattern recognition. Once we know that the problem has pattern we can probably use machine learning, but if the problem has random stuff is can be hard to use machine learning.\n\n### The problem cannot be derived mathematically (Optional)\n\nWhen we use machine learning it is better the problem `can't be derived mathematically`. If the problem can be derived mathematically then actually the problem can be programmed explicitly, example determining odd-even numbers etc. But there are problem that have pattern and can't be derived mathematically, example disease detection, desease detection cannot be derived into mathematic formula.\n\n\n## Machine Learning Type\n\n### Supervised Learning\n\nIn supervised learning, the algorithm is trained on a dataset that contains both input features (data) and corresponding output labels (desired results). So in supervised learning requires `data` and `labels` as input. There are 2 types of supervised learning `Classification` and `Regression`.\n\nCharacteristics of Supervised Learning:\n\n1. **Labeled Data**: The training data includes input-output pairs. Each example in the dataset comes with a label or outcome. For example:     \n   - Input: Features like height, weight, and age.\n   - Output: A label like \"healthy\" or \"unhealthy\" for a health prediction model.\n\n2. **Goal**: The algorithm tries to minimize the difference between its predicted outputs and the actual outputs by finding the best mapping from inputs to outputs during training.\n\n3. **Training Process**: \n   - The model is fed with a labeled dataset (both input features and output labels).\n   - The model makes predictions and compares them to the actual labels.\n   - Based on this comparison, the model adjusts its internal parameters to improve accuracy.\n   - This process repeats until the model achieves satisfactory performance on the training data.\n\n#### Classification\n\n> [note]: F(X) => [0,1] \n> \n> *or*\n> \n> F(X) => [0,1,2,...]\n\n- The goal is to assign data points to predefined `categories` or `classes`.\n- **Binary Classification**: Two possible classes (e.g., spam vs. non-spam emails).\n- **Multi-class Classification**: More than two classes (e.g., classifying types of flowers into species).\n- **Examples**:\n  - Diagnosing diseases as “positive” or “negative”.\n  - Credit Scoring as \"accepted\" or \"rejected\"\n  - Classifying whether a customer will churn or stay.\n\n#### Regression\n\n> [note]: F(X) => R\n\n- The goal is to predict continuous values (`numerical outcomes`).\n- **Examples**:\n  - Predicting house prices based on features like size and location.\n  - Forecasting stock prices.\n  - Predicting the temperature at a specific location.\n\n#### Supervised learning model pipeline\n\n![Supervised learning models](https://ogrisel.github.io/scikit-learn.org/sklearn-tutorial/_images/plot_ML_flow_chart_12.png)\n<p class=\"text-sm\">Image by: <a class=\"no-underline\" href=\"https://ogrisel.github.io/scikit-learn.org/sklearn-tutorial/tutorial/text_analytics/general_concepts.html#supervised-learning-model-fit-x-y\">scikit-learn</a></p>\n\n### Unsupervised Learning\n\nUnsupervised learning is a type of machine learning where the model is trained on data that has no labeled outcomes. Unlike supervised learning, where the goal is to map inputs to specific labels, unsupervised learning focuses on uncovering the underlying structure or patterns within the data. The primary objective is to discover hidden relationships or groupings without human intervention or guidance.\nIncluded in unsupervised learning are clustering, Dimensionality Reduction etc.\n\nCharacteristic of Unsupervised Learning:\n1. **No Labels**: The data used in unsupervised learning is not labeled. The model works on its own to detect patterns, clusters, or associations without predefined categories or answers.\n2. **Exploratory**: It’s primarily used for data exploration to find patterns, groupings, or structures in the data.\n3. **Unstructured Data**: Often applied to unstructured or unlabeled datasets, such as customer purchase data, social media activity, or image datasets.\n\n#### Clustering\n\n- The goal is to `group data points` into clusters such that items in the same group are more similar to each other than to those in other groups.\n  \n- **Examples**: \n  - Grouping customers based on purchasing behavior to create customer segments for targeted marketing.\n  - Clustering desease\n\n#### Dimensionality Reduction\n\n- The goal is to `reduce the number of features` (or dimensions) in the data while retaining the most important information. This can help visualize high-dimensional data or improve the performance of machine learning models.\n\n- **Example**: Reducing the number of variables in a gene expression dataset from thousands to a smaller, more manageable set of features.\n  \n#### Association\n\n- The goal is to find `relationships between variables` in large datasets. It’s commonly used in market basket analysis to find items that frequently appear together in transactions.\n\n- **Example**: Identifying that customers who buy bread often buy butter as well.\n\n#### Anomaly Detection\n\n- The goal is to identify `outliers or unusual data points` that do not conform to the expected pattern. This can be critical in fields like fraud detection or predictive maintenance.\n\n- **Example**: Detecting fraudulent credit card transactions based on deviations from normal spending behavior.\n\n#### Unsupervised learning model pipeline\n\n![Unsupervised learning models](https://ogrisel.github.io/scikit-learn.org/sklearn-tutorial/_images/plot_ML_flow_chart_32.png)\n<p class=\"text-sm\">Image by: <a class=\"no-underline\" href=\"https://ogrisel.github.io/scikit-learn.org/sklearn-tutorial/tutorial/text_analytics/general_concepts.html#unsupervised-learning-model-fit-x\">scikit-learn</a></p>\n\n\n### Reinforcement Learning\n\nReinforcement Learning (RL) is a type of machine learning in which an agent learns to make decisions by interacting with an environment in order to `maximize a reward`. Unlike supervised or unsupervised learning, reinforcement learning does not rely on labeled datasets or direct supervision. Instead, the agent `learns through trial and error`, receiving feedback in the form of rewards or penalties for actions it takes.\n\nApplications of Reinforcement Learning:\n- **Game AI**: RL has been used to achieve superhuman performance in games like chess (AlphaZero), Go, and video games (e.g., Atari, Dota 2). Algorithms like Deep Q-Networks (DQN) and AlphaGo have demonstrated the power of RL in strategic decision-making.\n\n- **Robotics**: RL is widely used in robotics for tasks like navigation, manipulation, and locomotion, where robots learn to interact with the physical environment through trial and error.\n\n- **Autonomous Vehicles**: Self-driving cars use reinforcement learning to make decisions about navigation, lane changing, and collision avoidance in dynamic, unpredictable environments.\n\n- **Healthcare**: RL\n\n#### The Reinforcement Learning Process\n1. **Initialization**: The agent starts in an initial state and does not know how the environment works.\n\n2. **Action Selection**: The agent selects an action based on its current policy.\n\n3. **Transition**: The action changes the state of the environment.\n\n4. **Reward**: The agent receives feedback (a reward) from the environment.\n\n5. **Learning**: Based on the reward, the agent updates its knowledge (usually the value function or policy) to improve future actions.\n\n6. **Repeat**: The process continues, with the agent learning and adapting its strategy over time to maximize cumulative rewards.\n","readingTime":"7 min read"}],"tag":"Machine Learning"},"__N_SSG":true}